export const data = [
  {
    "author": "VolkoIvan",
    "author_href": "https://habr.com/ru/users/VolkoIvan/",
    "bookmarks": 567,
    "comments": 214,
    "date": 1670610163,
    "hrefs": [
      "https://onlinesim.ru/",
      "https://chat.openai.com/auth/login"
    ],
    "hubs": [
      "Разработка веб-сайтов *",
      "Разработка мобильных приложений *",
      "Разработка игр *",
      "Дизайн игр *",
      "Искусственный интеллект"
    ],
    "tags": [
      "chatgpt",
      "llm",
      "openai",
      "доступ",
      "gpt",
      "chat",
      "bot",
      "chatbot"
    ],
    "text": [
      "Всем привет! Перед началом статьи сразу скажу:",
      "САМЫЙ ВАЖНЫЙ ДИСКЛЕЙМЕР: естественно, покупая смс на чужой номер вы полностью компрометируете безопасность своего аккаунта",
      "Мало ли кто его потом еще купит для получения доступа",
      "Поэтому, помните, что представленный в данной статье способ получения доступа - это только на \"поиграться\"",
      "Не стоит вводить туда свои реальные почты и использовать это в работе, так как полученный доступ может быть в любой момент взломан/прикрыт",
      "Но да ладно, приступим",
      "Здесь без всякого объяснения того что такое ChatGPT - кому надо тот знает",
      "В этой статье я хочу поделиться путем который вас за 30Р может к этому боту привести",
      "Вдаваться в детали я не хочу, это чисто статья для ребят которые хотят без лишних запар пройти путь человека который доступ к боту уже получил :)",
      "Как и многих вокруг, меня удивила новая технология от Open AI"
    ],
    "title": "Как получить доступ к chatGPT в России",
    "title_href": "https://habr.com/ru/post/704600/",
    "views": 748000,
    "votes": {
      "downvotes": 6,
      "upvotes": 73
    }
  },
  {
    "author": "telecomgod",
    "author_href": "https://habr.com/ru/users/telecomgod/",
    "bookmarks": 111,
    "comments": 60,
    "date": 1673938963,
    "hrefs": [
      "https://www.mtt.ru/services/voicebox/golosovoy-bot-mtt-voicebox/",
      "https://medium.com/geekculture/chatgpt-how-can-this-ia-improve-your-learning-5329a2e73c2f",
      "https://babich.biz/how-to-use-chatgpt-in-product-design/",
      "https://habr.com/ru/company/mtt/blog/703142/",
      "https://www.mtt.ru/services/voicebox/golosovoy-bot-mtt-voicebox/"
    ],
    "hubs": [
      "Блог компании МТТ",
      "Машинное обучение *",
      "Облачные сервисы *",
      "Голосовые интерфейсы *"
    ],
    "tags": [
      "chatgpt",
      "openai",
      "нейросеть",
      "языковая модель",
      "голосовые боты",
      "обзор",
      "чат-бот",
      "voicebox",
      "автоматизация рутины",
      "искусственный интеллект"
    ],
    "text": [
      "ChatGPT от OpenAI, запущенный 30 ноября 2022 года, произвел настоящий фурор в IT-сообществе, поразив многих точностью ответов на специальные вопросы",
      "Посмотрим, как можно использовать этого чат-бота, в том числе в сочетании с другими программными продуктами",
      "Напомню, если вы ещё не столкнулись с технологией, ChatGPT — это чат-бот с применением искусственного интеллекта",
      "Он умеет работать в диалоге и поддерживает запросы на естественных языках",
      "Тренировали его методами обучения с учителем и обучения с подкреплением",
      "Чат-бот по сути основан на GPT-3",
      "5",
      "Я заинтересовался технологией, чтобы применять её в каких-то своих рабочих задачах",
      "Хотя бы в сценариях с голосовым помощником VoiceBox",
      "Поэтому изучил все возможные на сегодня способы работы с ChatGPT и попробовал представить, как это внедрить в коммуникации в бизнесе"
    ],
    "title": "Обзор чат-бота ChatGPT: что это, возможности и примеры использования",
    "title_href": "https://habr.com/ru/company/mtt/blog/711052/",
    "views": 163000,
    "votes": {
      "downvotes": 5,
      "upvotes": 17
    }
  },
  {
    "author": "kuznetsoff87",
    "author_href": "https://habr.com/ru/users/kuznetsoff87/",
    "bookmarks": 88,
    "comments": 40,
    "date": 1672476867,
    "hrefs": [
      "https://openai.com/blog/chatgpt/",
      "https://meta.stackoverflow.com/questions/421831/temporary-policy-chatgpt-is-banned",
      "https://www.anaconda.com/blog/the-abilities-and-limitations-of-chatgpt",
      "https://meta.stackexchange.com/questions/384410/how-often-does-chatgpt-give-an-incorrect-answer-to-an-se-question",
      "https://www.nytimes.com/2022/12/21/technology/ai-chatgpt-google-search.html",
      "https://t.me/alexwortega",
      "https://t.me/dendimitrov",
      "https://t.me/complete_ai",
      "https://t.me/lovedeathtransformers"
    ],
    "hubs": [
      "Habr",
      "Исследования и прогнозы в IT *",
      "Искусственный интеллект"
    ],
    "tags": [
      "chatgpt",
      "обзор",
      "сравнение",
      "архитектура"
    ],
    "text": [
      "Одно из знаковых событий 2022 года помимо text-to-image моделей - это, безусловно, модель ChatGPT",
      "Выйдя на суд общества, она смогла найти как большой круг почитателей и восхищающихся её способностями, так и довольно существенное число скептиков и борцов за торжество Естественного Интеллекта",
      "Мы провели своё небольшое исследование её возможностей, проверили часть фактов, публикуемых в Интернете относительно ошибок и предвзятостей ChatGPT, и рады этим поделиться",
      "Модель запущена в публичное использование 30 ноября 2022",
      "К 5 декабря уже около 1М пользователей воспользовалось моделью",
      "Модель представляет собой файнтюн трансформенной архитектуры GPT-3",
      "5 (text-davinci-003), принадлежащей семейству моделей InstructGPT",
      "Для обучения модели из семейства InstructGPT используется подход обучения с подкреплением Reinforcement Learning with Human Feedback (RLHF), который позволяет улучшить базовую модель GPT-3 175B в сторону понимания более сложных пользовательских запросов/инструкций, уменьшения вероятность генерации недостоверной и токсичной информации",
      "Подход RLHF заключается в использовании модели вознаграждения (Reward Model, также называемой моделью предпочтений), откалиброванной в соответствии с экспертной оценкой",
      "Основная цель состоит в том, чтобы получить модель, которая принимает последовательность предложений и возвращает скалярное значение вознаграждения, которое должно численно отражать экспертную оценку"
    ],
    "title": "Обзор ChatGPT с примерами использования в различных задачах",
    "title_href": "https://habr.com/ru/post/708646/",
    "views": 74000,
    "votes": {
      "downvotes": 0,
      "upvotes": 19
    }
  },
  {
    "author": "arsmagic",
    "author_href": "https://habr.com/ru/users/arsmagic/",
    "bookmarks": 35,
    "comments": 24,
    "date": 1673924851,
    "hrefs": [
      "https://dzen.ru/a/Y8WU_fxXOxPQ3jIb",
      "https://vk.com/olga.yaponomat"
    ],
    "hubs": [
      "Копирайт",
      "Искусственный интеллект",
      "Социальные сети и сообщества"
    ],
    "tags": [
      "генерация текстов",
      "chatgpt",
      "методика",
      "пример",
      "выводы",
      "копирайтинг"
    ],
    "text": [
      "В процессе сотрудничества с одним из новостных порталов была озвучена задача генерации осмысленного текста по наборам тезисов",
      "Это увеличивает время пребывания пользователей на сайте, что, в свою очередь, привлекает рекламодателей",
      "Для этой цели воспользовались общедоступной версией ChatGPT от OpenAI",
      "Собственно, вот сама сгенерированная статья - \"Онлайн заработок - с чего начать?\"",
      "Навскидку была выбрана идея для статьи, были подобраны три последовательных вопроса, ставших заголовками секций:",
      "\"Какая лучшая стратегия для быстрого заработка без первоначальных вложений?\"",
      "\"Какие виды монетизации фриланса лучше всего оплачиваются?\"",
      "\"Как найти свою нишу во фрилансе?\"",
      "Каждый следующий вопрос был сгенерирован человеком как логическое уточнение и продолжение ответов алгоритма на предыдущий вопрос",
      "Вопросы и ответы генерировали на английском, далее с помощью переводчика Google всё переводилось на русский и производилась уже ручная минимальная корректировка текста для приведения в чуть более очеловеченный стиль"
    ],
    "title": "Первый опыт работы с ChatGPT с примером",
    "title_href": "https://habr.com/ru/post/711030/",
    "views": 11000,
    "votes": {
      "downvotes": 2,
      "upvotes": 4
    }
  },
  {
    "author": "root85",
    "author_href": "https://habr.com/ru/users/root85/",
    "bookmarks": 65,
    "comments": 64,
    "date": 1670436846,
    "hrefs": [
      "https://chat.openai.com",
      "https://github.com/mpociot/chatgpt-vscode"
    ],
    "hubs": [
      "Машинное обучение *",
      "Облачные сервисы *",
      "Искусственный интеллект"
    ],
    "tags": [
      "ChatGPT",
      "Go",
      "ai",
      "кодогенерация"
    ],
    "text": [
      "Одна из хайповых тем последней недели в англоязычном Твиттере – релиз ChatGPT от OpenAI",
      "Чат-бот который, по задумке авторов, может писать код, фиксить баги, и отвечать на сложные вопросы",
      "Я решил проверить, действительно ли ChatGPT может помочь разработчику",
      "Имею опыт программирования на разных языках, совсем недавно перешел на Go (пишу блокчейн-проект)",
      "Решил сузить задачу до такой: мог бы мне, разработчику с опытом, новичку в Go, хоть немного помочь ChatGPT",
      "Давайте начнем с простого",
      "Хочу найти элемент в срезе (slice) –  расширенном аналоге массива",
      "Давайте зададим вопрос боту",
      "MA в этом чате и далее – это я",
      "Что хорошо:"
    ],
    "title": "ChatGPT – хайп или реальная помощь разработчику?",
    "title_href": "https://habr.com/ru/post/704158/",
    "views": 61000,
    "votes": {
      "downvotes": 4,
      "upvotes": 27
    }
  },
  {
    "author": "AlexKimen",
    "author_href": "https://habr.com/ru/users/AlexKimen/",
    "bookmarks": 37,
    "comments": 25,
    "date": 1676261745,
    "hrefs": [
      "https://platform.openai.com/tokenizer"
    ],
    "hubs": [
      "Искусственный интеллект",
      "Natural Language Processing *"
    ],
    "tags": [
      "open ai",
      "chatgpt",
      "ии",
      "ии чат-бот",
      "токенизация"
    ],
    "text": [
      "Увидев очередную статью об утомившем всех Chat GPT от Open AI, рука невольно тянется в пистолету минусатору",
      "Ну, в самом деле, сколько можно? Уже, кажется, все успели поиграть с чатом во всех возможных сценариях",
      "Однако один аспект, почему‑то, почти не затронут как на Хабре, так и в Рунете",
      "Почему же все‑таки Chat GPT говорит по‑русски с весьма специфическим акцентом, который условно можно назвать «нейронным говорком»?",
      "Чтобы понять суть вопроса, обратимся к теории",
      "Чем занимается генеративная нейронная сеть такого типа?",
      "Говоря просто и коротко она получает на вход набор токенов, пропускает их через некий «черный ящик» и выдает другой набор токенов",
      "Вероятность выбора конкретного токена для ответа зависит от набора входящих токенов и конкретных настроек",
      "Но что же такое «токен»? Интересный факт заключается в том, что для английского языка токеном обычно выступают сочетания символов, зачастую совпадающие с короткими словами или часто встречающимися частями слов",
      "Возьмем, например, английскую панграмму:"
    ],
    "title": "Почему Chat GPT говорит по-русски с нейронным акцентом?  Специфика токенизации кириллицы нейронной сетью от Open AI",
    "title_href": "https://habr.com/ru/post/716460/",
    "views": 24000,
    "votes": {
      "downvotes": 2,
      "upvotes": 39
    }
  },
  {
    "author": "CodeShaman",
    "author_href": "https://habr.com/ru/users/CodeShaman/",
    "bookmarks": 34,
    "comments": 109,
    "date": 1676029513,
    "hrefs": [
      "http://habr.ru"
    ],
    "hubs": [
      "Python *",
      "Машинное обучение *",
      "Читальный зал",
      "Искусственный интеллект",
      "Будущее здесь"
    ],
    "tags": [
      "chatgpt",
      "статьи",
      "написание статей",
      "написание текстов",
      "нейросети"
    ],
    "text": [
      "Всем привет! На волне хайпа с chatGPT мне захотелось попробовать попросить нашумевшую нейронку сделать за меня работу писателя",
      "Я потратил 10 минут и вот, что из этого вышло",
      "Ниже текст самой статьи",
      "Без правок и редактуры, как сама сеть его сгенерировала по запросу \"Напиши мне статью в стиле статей портала habr",
      "ru на тему DDD в Python с использованием функционального программирования\":",
      "DDD (Domain-Driven Design) - это подход к разработке ПО, который сосредоточен на понимании бизнес-домена и его моделировании с помощью техник и шаблонов",
      "Он позволяет разработчикам создавать программные системы, которые эффективно отображают и поддерживают бизнес-процессы",
      "В последнее время DDD широко используется совместно с функциональным программированием для улучшения читаемости, масштабируемости и сопровождаемости кода",
      "Функциональное программирование предлагает множество инструментов для управления сложностью, а также подходящую модель программирования, которая легко совместима с концепциями DDD",
      "Одним из главных инструментов DDD является модель предметной области (Domain Model), которая отражает сущности и их взаимодействия в бизнес-домене"
    ],
    "title": "chatGPT написал за меня статью для Хабра и какой она вышла",
    "title_href": "https://habr.com/ru/post/716146/",
    "views": 28000,
    "votes": {
      "downvotes": 13,
      "upvotes": 50
    }
  },
  {
    "author": "VolkoIvan",
    "author_href": "https://habr.com/ru/users/VolkoIvan/",
    "bookmarks": 113,
    "comments": 204,
    "date": 1672254141,
    "hrefs": [
      "https://habr.com/ru/post/704600/",
      "https://vk.com/@volkoivan-goroskop-ot-mashiny-na-17-yanvarya",
      "https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/JSON",
      "https://medium.com/@justinomora/demystifying-the-signal-protocol-for-end-to-end-encryption-e2ee-ad6a567e6cb4",
      "https://github.com/f/awesome-chatgpt-prompts"
    ],
    "hubs": [
      "Разработка мобильных приложений *",
      "Алгоритмы *",
      "Машинное обучение *",
      "Управление разработкой *",
      "Будущее здесь"
    ],
    "tags": [
      "chatgpt",
      "искусственный интеллект",
      "искуственные нейронные сети",
      "чат",
      "чат-боты",
      "будущее",
      "профессия",
      "технологии"
    ],
    "text": [
      "3 недели назад я написал инструкцию о том как получить доступ к ChatGPT в России",
      "За это время она неожиданно набрала более 130т просмотров, что показывает явный интерес сообщества к этой теме",
      "За последнее время я собрал достаточно много интересной информации вокруг этой технологии и очень хочу с вами всем этим поделиться",
      "Я являюсь больше разработчиком мобильных приложений, а не специалистом в области ИИ - поэтому текст данной серии статей ориентирован больше на гипотетические размышления, чем на точные технические детали",
      "Если вы можете опровергнуть что-то из написанного мной - жду вас в комментариях!",
      "Меня (думаю, как и вас) появление ChatGPT и возникший вокруг него шум немного вывели из колеи",
      "Я прошел через следующие этапы:",
      "«Так, это что, альтернатива Copilot?»",
      "«А, оно не только с кодом работает?",
      "»"
    ],
    "title": "На какие профессии повлияет ChatGPT",
    "title_href": "https://habr.com/ru/post/708270/",
    "views": 38000,
    "votes": {
      "downvotes": 3,
      "upvotes": 55
    }
  },
  {
    "author": "obojealexander",
    "author_href": "https://habr.com/ru/users/obojealexander/",
    "bookmarks": 63,
    "comments": 17,
    "date": 1677942195,
    "hrefs": [
      "https://github.com/",
      "https://reqres.in/api/users?page=2"
    ],
    "hubs": [
      "Поисковые технологии *",
      "Тестирование веб-сервисов *",
      "Тестирование мобильных приложений *",
      "Машинное обучение *",
      "Искусственный интеллект"
    ],
    "tags": [
      "chatgpt",
      "искуственный интеллект",
      "тестирование по",
      "автоматизация тестирования",
      "нейронные сети",
      "machine learning",
      "эффективность тестирования",
      "оптимизация"
    ],
    "text": [
      "Всем привет! Я QA Engineer и недавно открыл для себя ChatGPT и хочу открыть этот мир другим тестировщикам",
      "Эта статья не руководство к применению и каких-то суперлайфхаков здесь не будет",
      "Цель этой статьи в том, чтобы показать огромные возможности нейросетей в помощи нам, тестировщикам, в работе",
      "Надеюсь что кто-то, прочитав это, хоть немного сможет облегчить себе составление тест-кейсов, написание документации или написание автотестов",
      "Примеров с написанием кода здесь по минимуму, так как таких материалов уже много",
      "Небольшая вводная:",
      "Преимущества применения ChatGPT в тестировании ПО:",
      "Автоматизация генерации тестовых данных: ChatGPT может использоваться для генерации различных тестовых данных, таких как исходные данные и ожидаемые результаты, что может значительно ускорить процесс тестирования",
      "Повышение качества тестирования: ChatGPT может использоваться для генерации более реалистичных и сложных тестовых случаев, которые могут помочь выявить более широкий спектр ошибок и проблем в ПО",
      "Сокращение времени тестирования: ChatGPT может ускорить процесс создания тестовых случаев и тестирования, что позволяет сократить время, затрачиваемое на ручное тестирование"
    ],
    "title": "ChatGPT: новый инструмент в борьбе с багами. Как можно использовать AI для повышения качества тестирования",
    "title_href": "https://habr.com/ru/post/720454/",
    "views": 8700,
    "votes": {
      "downvotes": 2,
      "upvotes": 13
    }
  },
  {
    "author": "ivanov_l",
    "author_href": "https://habr.com/ru/users/ivanov_l/",
    "bookmarks": 55,
    "comments": 89,
    "date": 1673285209,
    "hrefs": [
      "https://openai.com/blog/chatgpt/",
      "https://item-exchange-website-test.monstre.repl.co/"
    ],
    "hubs": [
      "Python *",
      "Машинное обучение *",
      "Искусственный интеллект",
      "Будущее здесь"
    ],
    "tags": [
      "chatgpt",
      "openai",
      "gpt-3",
      "ai",
      "искуственный интеллект",
      "машинное обучение",
      "python",
      "эксперименты",
      "приколы"
    ],
    "text": [
      "ChatGPT — это чат-бот с искусственным интеллектом, разработанный компанией OpenAI, который был выпущен 30-го ноября",
      "Возможности ChatGPT оказались очень впечатляющими",
      "Немного о том, что я заметил, пообщавшись с ним пару дней: о программировании, о дизайне и об исторических фактах,  — читайте в этой статье",
      "Последние пару недель все мои ленты в социальных сетях заполнились самыми разными заголовками постов о ChatGPT: \"ChatGPT заменит программистов?\", \"Как заработать на ChatGPT в 2023?\", \"НЕЙРОСЕТЬ ВЫДАЛА ЭТО\"",
      "Сначала мне не приходило в голову действительно интересных вопросов, которые я мог бы задать ChatGPT, поэтому желания с ним пообщаться у меня тоже почти не возникало",
      "В то же время я уже не один месяц хотел сделать удобный сайт для обмена б/у вещами, коего нету на локальном рынке страны, в которой я сейчас живу",
      "И вот однажды утром я, проснувшись, подумал, почему бы не попробовать, хотя бы просто ради интереса, сгенерировать такой сайт с помощью ChatGPT? Я быстро накидал ТЗ, сразу получил HTML код, запросил несколько правок, ещё пара запросов — и у меня есть бэкенд на Python+Flask…",
      "В общем, я потратил около 15 минут и в результате",
      "получил что-то вроде решения очень простого учебного задания",
      "Чтобы заморачиваться как можно меньше, я залил этот код на repl"
    ],
    "title": "Приколы с ChatGPT: обмануть или быть обманутым",
    "title_href": "https://habr.com/ru/post/709636/",
    "views": 48000,
    "votes": {
      "downvotes": 3,
      "upvotes": 38
    }
  }
]